2018-05-06-vim-quick-reference.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://notes.neeasade.netrss.xml"
      title="RSS feed for https://notes.neeasade.net"/>
<title>vim language quick reference</title>
<link href="assets/css/normalize.css" rel="stylesheet">
<link href="assets/css/sakura.css" rel="stylesheet">
<link href="assets/css/notes.css" rel="stylesheet"></head>
<body>
<div id="preamble" class="status">
</div>
<div id="content">
<div class="post-date">06 May 2018</div><h1 class="post-title"><a href="2018-05-06-vim-quick-reference.html">vim language quick reference</a></h1>
<p>
Example command <code>di"</code> (| is the cursor below):
</p>

<div class="org-src-container">
<pre class="src src-txt">somefunc("here is a |string") --&gt; somefunc("")
</pre>
</div>

<p>
The general form is <code>&lt;action&gt; &lt;operator&gt; &lt;text object&gt;</code>, or as I like to
think, <code>&lt;action&gt; &lt;verb&gt; &lt;noun&gt;</code>. Verbs modify nouns.
</p>

<p>
So, for <code>di"</code> above:
</p>

<ul class="org-ul">
<li><code>d</code> is the action (delete)</li>
<li><code>i</code> is the verb (inside)</li>
<li><code>"</code> is the noun (matching quotes)</li>
</ul>

<p>
Verbs are optional depending on the noun, but with this outline there
are many commands you compose.
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">action</th>
<th scope="col" class="org-left">mnemonic</th>
<th scope="col" class="org-left">meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">c</td>
<td class="org-left">change</td>
<td class="org-left">delete and enter insert mode</td>
</tr>

<tr>
<td class="org-left">d</td>
<td class="org-left">delete</td>
<td class="org-left">delete</td>
</tr>

<tr>
<td class="org-left">g</td>
<td class="org-left">go</td>
<td class="org-left">movement/jump to</td>
</tr>

<tr>
<td class="org-left">p</td>
<td class="org-left">paste</td>
<td class="org-left">paste</td>
</tr>

<tr>
<td class="org-left">r</td>
<td class="org-left">replace</td>
<td class="org-left">replace</td>
</tr>

<tr>
<td class="org-left">v</td>
<td class="org-left">visual</td>
<td class="org-left">enter visual mode</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-left">yank</td>
<td class="org-left">copy</td>
</tr>
</tbody>
</table>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">verb</th>
<th scope="col" class="org-left">mnemonic</th>
<th scope="col" class="org-left">meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">a</td>
<td class="org-left">around</td>
<td class="org-left">inclusive of noun selector</td>
</tr>

<tr>
<td class="org-left">i</td>
<td class="org-left">inside</td>
<td class="org-left">exclusive of noun selector</td>
</tr>

<tr>
<td class="org-left">f</td>
<td class="org-left">find</td>
<td class="org-left">forward to character, inclusive</td>
</tr>

<tr>
<td class="org-left">F</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">backward to character, inclusive</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">till</td>
<td class="org-left">forward to character, exclusive (character is the verb)</td>
</tr>

<tr>
<td class="org-left">T</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">backward to character, exclusive</td>
</tr>
</tbody>
</table>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">noun</th>
<th scope="col" class="org-left">mnemonic</th>
<th scope="col" class="org-left">meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">b</td>
<td class="org-left">block</td>
<td class="org-left">blocks of surrounding <code>([{</code> (implicit)</td>
</tr>

<tr>
<td class="org-left">p</td>
<td class="org-left">paragraph</td>
<td class="org-left">paragraph</td>
</tr>

<tr>
<td class="org-left">s</td>
<td class="org-left">sentence</td>
<td class="org-left">sentence</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">tag</td>
<td class="org-left"><code>&lt;tags&gt; pairs of &lt;/tags&gt;</code></td>
</tr>

<tr>
<td class="org-left">w</td>
<td class="org-left">word</td>
<td class="org-left">word</td>
</tr>

<tr>
<td class="org-left">%</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">matching [{( under cursor, inclusive</td>
</tr>

<tr>
<td class="org-left">&lt;,&gt;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>&lt;tags&gt; pairs of &lt;/tags&gt;</code></td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">backward to search result</td>
</tr>

<tr>
<td class="org-left"><code>'</code>,="<code>,=`</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">surrounding <code>"'`</code> pairs</td>
</tr>

<tr>
<td class="org-left"><code>(</code>,=[=,={<code>,</code>}=,=]=,=}=</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">surrounding <code>([{</code> pairs</td>
</tr>
</tbody>
</table>

<p>
You can install plugins to get more nouns and nice contextual actions.
For example with tpope's
<a href="https://github.com/tpope/vim-commentary">commentary</a> you get a <code>gc</code>
action for commenting in whatever programming language you are in &#x2013;
which you can compose with any of the above nouns and verbs!
</p>
</div>
<div id="postamble" class="status">
<a href="archive.html"> Other posts </a></div>
</body>
</html>
